bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/pwm_reg.h
// Copyright 2020-2021 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#pragma once


#ifdef __cplusplus
extern "C" {
#endif


#define PWM_REG0_ADDR (SOC_PWM_REG_BASE + (0x0 << 2))

#define PWM_REG0_DEVICEID_POS (0)
#define PWM_REG0_DEVICEID_MASK (0xffffffff)

#define PWM_REG1_ADDR (SOC_PWM_REG_BASE + (0x1 << 2))

#define PWM_REG1_VERSIONID_POS (0)
#define PWM_REG1_VERSIONID_MASK (0xffffffff)

#define PWM_REG2_ADDR (SOC_PWM_REG_BASE + (0x2 << 2))

#define PWM_REG2_SOFT_RESET_POS (0)
#define PWM_REG2_SOFT_RESET_MASK (0x1)

#define PWM_REG2_BPS_CLKGATE_POS (1)
#define PWM_REG2_BPS_CLKGATE_MASK (0x1)

#define PWM_REG2_RESERVED_BIT_2_31_POS (2)
#define PWM_REG2_RESERVED_BIT_2_31_MASK (0x3fffffff)

#define PWM_REG3_ADDR (SOC_PWM_REG_BASE + (0x3 << 2))

#define PWM_REG3_PWM_O_POS (0)
#define PWM_REG3_PWM_O_MASK (0xfff)

#define PWM_REG3_RESERVED_12_31_POS (12)
#define PWM_REG3_RESERVED_12_31_MASK (0xfffff)

#define PWM_REG4_ADDR (SOC_PWM_REG_BASE + (0x4 << 2))

#define PWM_REG4_CEN1_POS (0)
#define PWM_REG4_CEN1_MASK (0x1)

#define PWM_REG4_CEN2_POS (1)
#define PWM_REG4_CEN2_MASK (0x1)

#define PWM_REG4_CEN3_POS (2)
#define PWM_REG4_CEN3_MASK (0x1)

#define PWM_REG4_CEN4_POS (3)
#define PWM_REG4_CEN4_MASK (0x1)

#define PWM_REG4_CEN5_POS (4)
#define PWM_REG4_CEN5_MASK (0x1)

#define PWM_REG4_CEN6_POS (5)
#define PWM_REG4_CEN6_MASK (0x1)

#define PWM_REG4_CEN7_POS (6)
#define PWM_REG4_CEN7_MASK (0x1)

#define PWM_REG4_CEN8_POS (7)
#define PWM_REG4_CEN8_MASK (0x1)

#define PWM_REG4_CEN9_POS (8)
#define PWM_REG4_CEN9_MASK (0x1)

#define PWM_REG4_CEN10_POS (9)
#define PWM_REG4_CEN10_MASK (0x1)

#define PWM_REG4_CEN11_POS (10)
#define PWM_REG4_CEN11_MASK (0x1)

#define PWM_REG4_CEN12_POS (11)
#define PWM_REG4_CEN12_MASK (0x1)

#define PWM_REG4_SYNC_ALLPSC_POS (12)
#define PWM_REG4_SYNC_ALLPSC_MASK (0x1)

#define PWM_REG4_SYNC_ALLPSC_EN_POS (13)
#define PWM_REG4_SYNC_ALLPSC_EN_MASK (0x1)

#define PWM_REG4_RESERVED_14_31_POS (14)
#define PWM_REG4_RESERVED_14_31_MASK (0x3ffff)

#define PWM_REG10_ADDR (SOC_PWM_REG_BASE + (0x10 << 2))

#define PWM_REG10_PWM_O_0_ALLOCATE_POS (0)
#define PWM_REG10_PWM_O_0_ALLOCATE_MASK (0xffffffff)

#define PWM_REG11_ADDR (SOC_PWM_REG_BASE + (0x11 << 2))

#define PWM_REG11_PWM_O_1_ALLOCATE_POS (0)
#define PWM_REG11_PWM_O_1_ALLOCATE_MASK (0xffffffff)

#define PWM_REG12_ADDR (SOC_PWM_REG_BASE + (0x12 << 2))

#define PWM_REG12_PWM_O_2_ALLOCATE_POS (0)
#define PWM_REG12_PWM_O_2_ALLOCATE_MASK (0xffffffff)

#define PWM_REG13_ADDR (SOC_PWM_REG_BASE + (0x13 << 2))

#define PWM_REG13_PWM_O_3_ALLOCATE_POS (0)
#define PWM_REG13_PWM_O_3_ALLOCATE_MASK (0xffffffff)

#define PWM_REG14_ADDR (SOC_PWM_REG_BASE + (0x14 << 2))

#define PWM_REG14_PWM_O_4_ALLOCATE_POS (0)
#define PWM_REG14_PWM_O_4_ALLOCATE_MASK (0xffffffff)

#define PWM_REG15_ADDR (SOC_PWM_REG_BASE + (0x15 << 2))

#define PWM_REG15_PWM_O_5_ALLOCATE_POS (0)
#define PWM_REG15_PWM_O_5_ALLOCATE_MASK (0xffffffff)

#define PWM_REG16_ADDR (SOC_PWM_REG_BASE + (0x16 << 2))

#define PWM_REG16_PWM_O_6_ALLOCATE_POS (0)
#define PWM_REG16_PWM_O_6_ALLOCATE_MASK (0xffffffff)

#define PWM_REG17_ADDR (SOC_PWM_REG_BASE + (0x17 << 2))

#define PWM_REG17_PWM_O_7_ALLOCATE_POS (0)
#define PWM_REG17_PWM_O_7_ALLOCATE_MASK (0xffffffff)

#define PWM_REG18_ADDR (SOC_PWM_REG_BASE + (0x18 << 2))

#define PWM_REG18_PWM_O_8_ALLOCATE_POS (0)
#define PWM_REG18_PWM_O_8_ALLOCATE_MASK (0xffffffff)

#define PWM_REG19_ADDR (SOC_PWM_REG_BASE + (0x19 << 2))

#define PWM_REG19_PWM_O_9_ALLOCATE_POS (0)
#define PWM_REG19_PWM_O_9_ALLOCATE_MASK (0xffffffff)

#define PWM_REG1A_ADDR (SOC_PWM_REG_BASE + (0x1a << 2))

#define PWM_REG1A_PWM_O_10_ALLOCATE_POS (0)
#define PWM_REG1A_PWM_O_10_ALLOCATE_MASK (0xffffffff)

#define PWM_REG1B_ADDR (SOC_PWM_REG_BASE + (0x1b << 2))

#define PWM_REG1B_PWM_O_11_ALLOCATE_POS (0)
#define PWM_REG1B_PWM_O_11_ALLOCATE_MASK (0xffffffff)

#define PWM_REG20_ADDR (SOC_PWM_REG_BASE + (0x20 << 2))

#define PWM_REG20_PWM_I_0_ALLOCATE_POS (0)
#define PWM_REG20_PWM_I_0_ALLOCATE_MASK (0xffffffff)

#define PWM_REG21_ADDR (SOC_PWM_REG_BASE + (0x21 << 2))

#define PWM_REG21_PWM_I_1_ALLOCATE_POS (0)
#define PWM_REG21_PWM_I_1_ALLOCATE_MASK (0xffffffff)

#define PWM_REG22_ADDR (SOC_PWM_REG_BASE + (0x22 << 2))

#define PWM_REG22_PWM_I_2_ALLOCATE_POS (0)
#define PWM_REG22_PWM_I_2_ALLOCATE_MASK (0xffffffff)

#define PWM_REG23_ADDR (SOC_PWM_REG_BASE + (0x23 << 2))

#define PWM_REG23_PWM_I_3_ALLOCATE_POS (0)
#define PWM_REG23_PWM_I_3_ALLOCATE_MASK (0xffffffff)

#define PWM_REG24_ADDR (SOC_PWM_REG_BASE + (0x24 << 2))

#define PWM_REG24_PWM_I_4_ALLOCATE_POS (0)
#define PWM_REG24_PWM_I_4_ALLOCATE_MASK (0xffffffff)

#define PWM_REG25_ADDR (SOC_PWM_REG_BASE + (0x25 << 2))

#define PWM_REG25_PWM_I_5_ALLOCATE_POS (0)
#define PWM_REG25_PWM_I_5_ALLOCATE_MASK (0xffffffff)

#define PWM_REG26_ADDR (SOC_PWM_REG_BASE + (0x26 << 2))

#define PWM_REG26_PWM_I_6_ALLOCATE_POS (0)
#define PWM_REG26_PWM_I_6_ALLOCATE_MASK (0xffffffff)

#define PWM_REG27_ADDR (SOC_PWM_REG_BASE + (0x27 << 2))

#define PWM_REG27_PWM_I_7_ALLOCATE_POS (0)
#define PWM_REG27_PWM_I_7_ALLOCATE_MASK (0xffffffff)

#define PWM_REG28_ADDR (SOC_PWM_REG_BASE + (0x28 << 2))

#define PWM_REG28_PWM_I_8_ALLOCATE_POS (0)
#define PWM_REG28_PWM_I_8_ALLOCATE_MASK (0xffffffff)

#define PWM_REG29_ADDR (SOC_PWM_REG_BASE + (0x29 << 2))

#define PWM_REG29_PWM_I_9_ALLOCATE_POS (0)
#define PWM_REG29_PWM_I_9_ALLOCATE_MASK (0xffffffff)

#define PWM_REG2A_ADDR (SOC_PWM_REG_BASE + (0x2a << 2))

#define PWM_REG2A_PWM_I_10_ALLOCATE_POS (0)
#define PWM_REG2A_PWM_I_10_ALLOCATE_MASK (0xffffffff)

#define PWM_REG2B_ADDR (SOC_PWM_REG_BASE + (0x2b << 2))

#define PWM_REG2B_PWM_I_11_ALLOCATE_POS (0)
#define PWM_REG2B_PWM_I_11_ALLOCATE_MASK (0xffffffff)

