bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/pwm_reg.h
#define PWM_REG2C_ADDR (SOC_PWM_REG_BASE + (0x2c << 2))

#define PWM_REG2C_PWM_I_12_ALLOCATE_POS (0)
#define PWM_REG2C_PWM_I_12_ALLOCATE_MASK (0xffffffff)

#define PWM_REG2D_ADDR (SOC_PWM_REG_BASE + (0x2d << 2))

#define PWM_REG2D_PWM_I_13_ALLOCATE_POS (0)
#define PWM_REG2D_PWM_I_13_ALLOCATE_MASK (0xffffffff)

#define PWM_REG2E_ADDR (SOC_PWM_REG_BASE + (0x2e << 2))

#define PWM_REG2E_PWM_I_14_ALLOCATE_POS (0)
#define PWM_REG2E_PWM_I_14_ALLOCATE_MASK (0xffffffff)

#define PWM_REG2F_ADDR (SOC_PWM_REG_BASE + (0x2f << 2))

#define PWM_REG2F_PWM_I_15_ALLOCATE_POS (0)
#define PWM_REG2F_PWM_I_15_ALLOCATE_MASK (0xffffffff)

#define PWM_REG30_ADDR (SOC_PWM_REG_BASE + (0x30 << 2))

#define PWM_REG30_PWM_I_16_ALLOCATE_POS (0)
#define PWM_REG30_PWM_I_16_ALLOCATE_MASK (0xffffffff)

#define PWM_REG31_ADDR (SOC_PWM_REG_BASE + (0x31 << 2))

#define PWM_REG31_PWM_I_17_ALLOCATE_POS (0)
#define PWM_REG31_PWM_I_17_ALLOCATE_MASK (0xffffffff)

#define PWM_REG32_ADDR (SOC_PWM_REG_BASE + (0x32 << 2))

#define PWM_REG32_PWM_I_18_ALLOCATE_POS (0)
#define PWM_REG32_PWM_I_18_ALLOCATE_MASK (0xffffffff)

#define PWM_REG33_ADDR (SOC_PWM_REG_BASE + (0x33 << 2))

#define PWM_REG33_PWM_I_19_ALLOCATE_POS (0)
#define PWM_REG33_PWM_I_19_ALLOCATE_MASK (0xffffffff)

#define PWM_REG34_ADDR (SOC_PWM_REG_BASE + (0x34 << 2))

#define PWM_REG34_PWM_I_20_ALLOCATE_POS (0)
#define PWM_REG34_PWM_I_20_ALLOCATE_MASK (0xffffffff)

#define PWM_REG35_ADDR (SOC_PWM_REG_BASE + (0x35 << 2))

#define PWM_REG35_PWM_I_21_ALLOCATE_POS (0)
#define PWM_REG35_PWM_I_21_ALLOCATE_MASK (0xffffffff)

#define PWM_REG36_ADDR (SOC_PWM_REG_BASE + (0x36 << 2))

#define PWM_REG36_PWM_I_22_ALLOCATE_POS (0)
#define PWM_REG36_PWM_I_22_ALLOCATE_MASK (0xffffffff)

#define PWM_REG37_ADDR (SOC_PWM_REG_BASE + (0x37 << 2))

#define PWM_REG37_PWM_I_23_ALLOCATE_POS (0)
#define PWM_REG37_PWM_I_23_ALLOCATE_MASK (0xffffffff)

#define PWM_REG40_ADDR (SOC_PWM_REG_BASE + (0x40 << 2))

#define PWM_REG40_OCM3PE_POS (0)
#define PWM_REG40_OCM3PE_MASK (0x1)

#define PWM_REG40_OCM2PE_POS (1)
#define PWM_REG40_OCM2PE_MASK (0x1)

#define PWM_REG40_OCM1PE_POS (2)
#define PWM_REG40_OCM1PE_MASK (0x1)

#define PWM_REG40_ARPE3_POS (3)
#define PWM_REG40_ARPE3_MASK (0x1)

#define PWM_REG40_ARPE2_POS (4)
#define PWM_REG40_ARPE2_MASK (0x1)

#define PWM_REG40_ARPE1_POS (5)
#define PWM_REG40_ARPE1_MASK (0x1)

#define PWM_REG40_OC3PE_POS (6)
#define PWM_REG40_OC3PE_MASK (0x1)

#define PWM_REG40_OC2PE_POS (7)
#define PWM_REG40_OC2PE_MASK (0x1)

#define PWM_REG40_OC1PE_POS (8)
#define PWM_REG40_OC1PE_MASK (0x1)

#define PWM_REG40_RESERVED_9_17_POS (9)
#define PWM_REG40_RESERVED_9_17_MASK (0x1ff)

#define PWM_REG40_CMS_TIM3_POS (18)
#define PWM_REG40_CMS_TIM3_MASK (0x3)

#define PWM_REG40_CMS_TIM2_POS (20)
#define PWM_REG40_CMS_TIM2_MASK (0x3)

#define PWM_REG40_CMS_TIM1_POS (22)
#define PWM_REG40_CMS_TIM1_MASK (0x3)

#define PWM_REG40_RESERVED_24_25_POS (24)
#define PWM_REG40_RESERVED_24_25_MASK (0x3)

#define PWM_REG40_URS3_POS (26)
#define PWM_REG40_URS3_MASK (0x1)

#define PWM_REG40_URS2_POS (27)
#define PWM_REG40_URS2_MASK (0x1)

#define PWM_REG40_URS1_POS (28)
#define PWM_REG40_URS1_MASK (0x1)

#define PWM_REG40_DIR_TIM3_POS (29)
#define PWM_REG40_DIR_TIM3_MASK (0x1)

#define PWM_REG40_DIR_TIM2_POS (30)
#define PWM_REG40_DIR_TIM2_MASK (0x1)

#define PWM_REG40_DIR_TIM1_POS (31)
#define PWM_REG40_DIR_TIM1_MASK (0x1)

#define PWM_REG41_ADDR (SOC_PWM_REG_BASE + (0x41 << 2))

#define PWM_REG41_RESERVED_0_7_POS (0)
#define PWM_REG41_RESERVED_0_7_MASK (0xff)

#define PWM_REG41_COM_MODE_POS (8)
#define PWM_REG41_COM_MODE_MASK (0x1)

#define PWM_REG41_CCPC_POS (9)
#define PWM_REG41_CCPC_MASK (0x1)

#define PWM_REG41_TRIOS3_POS (10)
#define PWM_REG41_TRIOS3_MASK (0x7)

#define PWM_REG41_ADCS3_POS (13)
#define PWM_REG41_ADCS3_MASK (0x7)

#define PWM_REG41_RESERVED_16_16_POS (16)
#define PWM_REG41_RESERVED_16_16_MASK (0x1)

#define PWM_REG41_CCUS_POS (17)
#define PWM_REG41_CCUS_MASK (0x1)

#define PWM_REG41_TRIOS2_POS (18)
#define PWM_REG41_TRIOS2_MASK (0x7)

#define PWM_REG41_ADCS2_POS (21)
#define PWM_REG41_ADCS2_MASK (0x7)

#define PWM_REG41_RESERVED_24_25_POS (24)
#define PWM_REG41_RESERVED_24_25_MASK (0x3)

#define PWM_REG41_TRIOS1_POS (26)
#define PWM_REG41_TRIOS1_MASK (0x7)

#define PWM_REG41_ADCS1_POS (29)
#define PWM_REG41_ADCS1_MASK (0x7)

#define PWM_REG42_ADDR (SOC_PWM_REG_BASE + (0x42 << 2))

#define PWM_REG42_SMS1_POS (0)
#define PWM_REG42_SMS1_MASK (0xf)

#define PWM_REG42_SMS2_POS (4)
#define PWM_REG42_SMS2_MASK (0xf)

#define PWM_REG42_SMS3_POS (8)
#define PWM_REG42_SMS3_MASK (0xf)

#define PWM_REG42_TS1_POS (12)
#define PWM_REG42_TS1_MASK (0x7)

#define PWM_REG42_RESERVED_15_15_POS (15)
#define PWM_REG42_RESERVED_15_15_MASK (0x1)

#define PWM_REG42_TS2_POS (16)
#define PWM_REG42_TS2_MASK (0x7)

#define PWM_REG42_TS3_POS (19)
#define PWM_REG42_TS3_MASK (0x7)

#define PWM_REG42_RESERVED_22_31_POS (22)
#define PWM_REG42_RESERVED_22_31_MASK (0x3ff)

#define PWM_REG43_ADDR (SOC_PWM_REG_BASE + (0x43 << 2))

#define PWM_REG43_CC1IE_POS (0)
#define PWM_REG43_CC1IE_MASK (0x1)

#define PWM_REG43_CC2IE_POS (1)
#define PWM_REG43_CC2IE_MASK (0x1)

#define PWM_REG43_CC3IE_POS (2)
#define PWM_REG43_CC3IE_MASK (0x1)

#define PWM_REG43_CC4IE_POS (3)
#define PWM_REG43_CC4IE_MASK (0x1)

#define PWM_REG43_CC5IE_POS (4)
#define PWM_REG43_CC5IE_MASK (0x1)

#define PWM_REG43_CC6IE_POS (5)
#define PWM_REG43_CC6IE_MASK (0x1)

#define PWM_REG43_CC7IE_POS (6)
#define PWM_REG43_CC7IE_MASK (0x1)

#define PWM_REG43_CC8IE_POS (7)
#define PWM_REG43_CC8IE_MASK (0x1)

#define PWM_REG43_CC9IE_POS (8)
#define PWM_REG43_CC9IE_MASK (0x1)

#define PWM_REG43_UIE1_POS (9)
#define PWM_REG43_UIE1_MASK (0x1)

#define PWM_REG43_UIE2_POS (10)
#define PWM_REG43_UIE2_MASK (0x1)

#define PWM_REG43_UIE3_POS (11)
#define PWM_REG43_UIE3_MASK (0x1)

#define PWM_REG43_TIE1_POS (12)
#define PWM_REG43_TIE1_MASK (0x1)

#define PWM_REG43_TIE2_POS (13)
#define PWM_REG43_TIE2_MASK (0x1)

#define PWM_REG43_TIE3_POS (14)
#define PWM_REG43_TIE3_MASK (0x1)

#define PWM_REG43_COMIE_POS (15)
#define PWM_REG43_COMIE_MASK (0x1)

#define PWM_REG43_RESERVED_16_19_POS (16)
#define PWM_REG43_RESERVED_16_19_MASK (0xf)

#define PWM_REG43_DF_TIM1_POS (20)
#define PWM_REG43_DF_TIM1_MASK (0xf)

#define PWM_REG43_DF_TIM2_POS (24)
#define PWM_REG43_DF_TIM2_MASK (0xf)

