bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/pwm_reg.h
#define PWM_REG82_SMS1_POS (0)
#define PWM_REG82_SMS1_MASK (0xf)

#define PWM_REG82_SMS2_POS (4)
#define PWM_REG82_SMS2_MASK (0xf)

#define PWM_REG82_SMS3_POS (8)
#define PWM_REG82_SMS3_MASK (0xf)

#define PWM_REG82_TS1_POS (12)
#define PWM_REG82_TS1_MASK (0x7)

#define PWM_REG82_RESERVED_15_15_POS (15)
#define PWM_REG82_RESERVED_15_15_MASK (0x1)

#define PWM_REG82_TS2_POS (16)
#define PWM_REG82_TS2_MASK (0x7)

#define PWM_REG82_TS3_POS (19)
#define PWM_REG82_TS3_MASK (0x7)

#define PWM_REG82_RESERVED_22_31_POS (22)
#define PWM_REG82_RESERVED_22_31_MASK (0x3ff)

#define PWM_REG83_ADDR (SOC_PWM_REG_BASE + (0x83 << 2))

#define PWM_REG83_CC1IE_POS (0)
#define PWM_REG83_CC1IE_MASK (0x1)

#define PWM_REG83_CC2IE_POS (1)
#define PWM_REG83_CC2IE_MASK (0x1)

#define PWM_REG83_CC3IE_POS (2)
#define PWM_REG83_CC3IE_MASK (0x1)

#define PWM_REG83_CC4IE_POS (3)
#define PWM_REG83_CC4IE_MASK (0x1)

#define PWM_REG83_CC5IE_POS (4)
#define PWM_REG83_CC5IE_MASK (0x1)

#define PWM_REG83_CC6IE_POS (5)
#define PWM_REG83_CC6IE_MASK (0x1)

#define PWM_REG83_CC7IE_POS (6)
#define PWM_REG83_CC7IE_MASK (0x1)

#define PWM_REG83_CC8IE_POS (7)
#define PWM_REG83_CC8IE_MASK (0x1)

#define PWM_REG83_CC9IE_POS (8)
#define PWM_REG83_CC9IE_MASK (0x1)

#define PWM_REG83_UIE1_POS (9)
#define PWM_REG83_UIE1_MASK (0x1)

#define PWM_REG83_UIE2_POS (10)
#define PWM_REG83_UIE2_MASK (0x1)

#define PWM_REG83_UIE3_POS (11)
#define PWM_REG83_UIE3_MASK (0x1)

#define PWM_REG83_TIE1_POS (12)
#define PWM_REG83_TIE1_MASK (0x1)

#define PWM_REG83_TIE2_POS (13)
#define PWM_REG83_TIE2_MASK (0x1)

#define PWM_REG83_TIE3_POS (14)
#define PWM_REG83_TIE3_MASK (0x1)

#define PWM_REG83_COMIE_POS (15)
#define PWM_REG83_COMIE_MASK (0x1)

#define PWM_REG83_RESERVED_16_19_POS (16)
#define PWM_REG83_RESERVED_16_19_MASK (0xf)

#define PWM_REG83_DF_TIM1_POS (20)
#define PWM_REG83_DF_TIM1_MASK (0xf)

#define PWM_REG83_DF_TIM2_POS (24)
#define PWM_REG83_DF_TIM2_MASK (0xf)

#define PWM_REG83_DF_TIM3_POS (28)
#define PWM_REG83_DF_TIM3_MASK (0xf)

#define PWM_REG84_ADDR (SOC_PWM_REG_BASE + (0x84 << 2))

#define PWM_REG84_CC1IF_POS (0)
#define PWM_REG84_CC1IF_MASK (0x1)

#define PWM_REG84_CC2IF_POS (1)
#define PWM_REG84_CC2IF_MASK (0x1)

#define PWM_REG84_CC3IF_POS (2)
#define PWM_REG84_CC3IF_MASK (0x1)

#define PWM_REG84_CC4IF_POS (3)
#define PWM_REG84_CC4IF_MASK (0x1)

#define PWM_REG84_CC5IF_POS (4)
#define PWM_REG84_CC5IF_MASK (0x1)

#define PWM_REG84_CC6IF_POS (5)
#define PWM_REG84_CC6IF_MASK (0x1)

#define PWM_REG84_CC7IF_POS (6)
#define PWM_REG84_CC7IF_MASK (0x1)

#define PWM_REG84_CC8IF_POS (7)
#define PWM_REG84_CC8IF_MASK (0x1)

#define PWM_REG84_CC9IF_POS (8)
#define PWM_REG84_CC9IF_MASK (0x1)

#define PWM_REG84_UIF1_POS (9)
#define PWM_REG84_UIF1_MASK (0x1)

#define PWM_REG84_UIF2_POS (10)
#define PWM_REG84_UIF2_MASK (0x1)

#define PWM_REG84_UIF3_POS (11)
#define PWM_REG84_UIF3_MASK (0x1)

#define PWM_REG84_TIF1_POS (12)
#define PWM_REG84_TIF1_MASK (0x1)

#define PWM_REG84_TIF2_POS (13)
#define PWM_REG84_TIF2_MASK (0x1)

#define PWM_REG84_TIF3_POS (14)
#define PWM_REG84_TIF3_MASK (0x1)

#define PWM_REG84_COMIF_POS (15)
#define PWM_REG84_COMIF_MASK (0x1)

#define PWM_REG84_RESERVED_16_31_POS (16)
#define PWM_REG84_RESERVED_16_31_MASK (0xffff)

#define PWM_REG85_ADDR (SOC_PWM_REG_BASE + (0x85 << 2))

#define PWM_REG85_RESERVED_0_8_POS (0)
#define PWM_REG85_RESERVED_0_8_MASK (0x1ff)

#define PWM_REG85_UG1_POS (9)
#define PWM_REG85_UG1_MASK (0x1)

#define PWM_REG85_UG2_POS (10)
#define PWM_REG85_UG2_MASK (0x1)

#define PWM_REG85_UG3_POS (11)
#define PWM_REG85_UG3_MASK (0x1)

#define PWM_REG85_TG1_POS (12)
#define PWM_REG85_TG1_MASK (0x1)

#define PWM_REG85_TG2_POS (13)
#define PWM_REG85_TG2_MASK (0x1)

#define PWM_REG85_TG3_POS (14)
#define PWM_REG85_TG3_MASK (0x1)

#define PWM_REG85_COMG_POS (15)
#define PWM_REG85_COMG_MASK (0x1)

#define PWM_REG85_DTM1_POS (16)
#define PWM_REG85_DTM1_MASK (0x3)

#define PWM_REG85_DTM2_POS (18)
#define PWM_REG85_DTM2_MASK (0x3)

#define PWM_REG85_DTM3_POS (20)
#define PWM_REG85_DTM3_MASK (0x3)

#define PWM_REG85_RESERVED_22_31_POS (22)
#define PWM_REG85_RESERVED_22_31_MASK (0x3ff)

#define PWM_REG86_ADDR (SOC_PWM_REG_BASE + (0x86 << 2))

#define PWM_REG86_CH1P_POS (0)
#define PWM_REG86_CH1P_MASK (0x3)

#define PWM_REG86_CH2P_POS (2)
#define PWM_REG86_CH2P_MASK (0x3)

#define PWM_REG86_CH3P_POS (4)
#define PWM_REG86_CH3P_MASK (0x3)

#define PWM_REG86_CH4P_POS (6)
#define PWM_REG86_CH4P_MASK (0x3)

#define PWM_REG86_CH5P_POS (8)
#define PWM_REG86_CH5P_MASK (0x3)

#define PWM_REG86_CH6P_POS (10)
#define PWM_REG86_CH6P_MASK (0x3)

#define PWM_REG86_CH1E_POS (12)
#define PWM_REG86_CH1E_MASK (0x1)

#define PWM_REG86_CH2E_POS (13)
#define PWM_REG86_CH2E_MASK (0x1)

#define PWM_REG86_CH3E_POS (14)
#define PWM_REG86_CH3E_MASK (0x1)

#define PWM_REG86_CH4E_POS (15)
#define PWM_REG86_CH4E_MASK (0x1)

#define PWM_REG86_CH5E_POS (16)
#define PWM_REG86_CH5E_MASK (0x1)

#define PWM_REG86_CH6E_POS (17)
#define PWM_REG86_CH6E_MASK (0x1)

#define PWM_REG86_TIM1CCM_POS (18)
#define PWM_REG86_TIM1CCM_MASK (0x1)

#define PWM_REG86_TIM2CCM_POS (19)
#define PWM_REG86_TIM2CCM_MASK (0x1)

#define PWM_REG86_TIM3CCM_POS (20)
#define PWM_REG86_TIM3CCM_MASK (0x1)

#define PWM_REG86_OC1M_POS (21)
#define PWM_REG86_OC1M_MASK (0x7)

#define PWM_REG86_OC2M_POS (24)
#define PWM_REG86_OC2M_MASK (0x7)

#define PWM_REG86_OC3M_POS (27)
#define PWM_REG86_OC3M_MASK (0x7)

#define PWM_REG86_RESERVED_30_31_POS (30)
#define PWM_REG86_RESERVED_30_31_MASK (0x3)

#define PWM_REG87_ADDR (SOC_PWM_REG_BASE + (0x87 << 2))

#define PWM_REG87_TIM1_CNT_POS (0)
#define PWM_REG87_TIM1_CNT_MASK (0xffffffff)

#define PWM_REG88_ADDR (SOC_PWM_REG_BASE + (0x88 << 2))

#define PWM_REG88_TIM2_CNT_POS (0)
#define PWM_REG88_TIM2_CNT_MASK (0xffffffff)

#define PWM_REG89_ADDR (SOC_PWM_REG_BASE + (0x89 << 2))

#define PWM_REG89_TIM3_CNT_POS (0)
#define PWM_REG89_TIM3_CNT_MASK (0xffffffff)

#define PWM_REG8A_ADDR (SOC_PWM_REG_BASE + (0x8a << 2))

#define PWM_REG8A_PSC1_POS (0)
#define PWM_REG8A_PSC1_MASK (0xff)

#define PWM_REG8A_PSC2_POS (8)
#define PWM_REG8A_PSC2_MASK (0xff)

#define PWM_REG8A_PSC3_POS (16)
#define PWM_REG8A_PSC3_MASK (0xff)

#define PWM_REG8A_RESERVED_24_31_POS (24)
#define PWM_REG8A_RESERVED_24_31_MASK (0xff)

#define PWM_REG8B_ADDR (SOC_PWM_REG_BASE + (0x8b << 2))

#define PWM_REG8B_TIM1_ARR_POS (0)
#define PWM_REG8B_TIM1_ARR_MASK (0xffffffff)

#define PWM_REG8C_ADDR (SOC_PWM_REG_BASE + (0x8c << 2))

#define PWM_REG8C_TIM2_ARR_POS (0)
#define PWM_REG8C_TIM2_ARR_MASK (0xffffffff)

#define PWM_REG8D_ADDR (SOC_PWM_REG_BASE + (0x8d << 2))

