bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/pwm_reg.h
#define PWM_REGC0_URS2_POS (27)
#define PWM_REGC0_URS2_MASK (0x1)

#define PWM_REGC0_URS1_POS (28)
#define PWM_REGC0_URS1_MASK (0x1)

#define PWM_REGC0_DIR_TIM3_POS (29)
#define PWM_REGC0_DIR_TIM3_MASK (0x1)

#define PWM_REGC0_DIR_TIM2_POS (30)
#define PWM_REGC0_DIR_TIM2_MASK (0x1)

#define PWM_REGC0_DIR_TIM1_POS (31)
#define PWM_REGC0_DIR_TIM1_MASK (0x1)

#define PWM_REGC1_ADDR (SOC_PWM_REG_BASE + (0xc1 << 2))

#define PWM_REGC1_RESERVED_0_7_POS (0)
#define PWM_REGC1_RESERVED_0_7_MASK (0xff)

#define PWM_REGC1_COM_MODE_POS (8)
#define PWM_REGC1_COM_MODE_MASK (0x1)

#define PWM_REGC1_CCPC_POS (9)
#define PWM_REGC1_CCPC_MASK (0x1)

#define PWM_REGC1_TRIOS3_POS (10)
#define PWM_REGC1_TRIOS3_MASK (0x7)

#define PWM_REGC1_ADCS3_POS (13)
#define PWM_REGC1_ADCS3_MASK (0x7)

#define PWM_REGC1_RESERVED_16_16_POS (16)
#define PWM_REGC1_RESERVED_16_16_MASK (0x1)

#define PWM_REGC1_CCUS_POS (17)
#define PWM_REGC1_CCUS_MASK (0x1)

#define PWM_REGC1_TRIOS2_POS (18)
#define PWM_REGC1_TRIOS2_MASK (0x7)

#define PWM_REGC1_ADCS2_POS (21)
#define PWM_REGC1_ADCS2_MASK (0x7)

#define PWM_REGC1_RESERVED_24_25_POS (24)
#define PWM_REGC1_RESERVED_24_25_MASK (0x3)

#define PWM_REGC1_TRIOS1_POS (26)
#define PWM_REGC1_TRIOS1_MASK (0x7)

#define PWM_REGC1_ADCS1_POS (29)
#define PWM_REGC1_ADCS1_MASK (0x7)

#define PWM_REGC2_ADDR (SOC_PWM_REG_BASE + (0xc2 << 2))

#define PWM_REGC2_SMS1_POS (0)
#define PWM_REGC2_SMS1_MASK (0xf)

#define PWM_REGC2_SMS2_POS (4)
#define PWM_REGC2_SMS2_MASK (0xf)

#define PWM_REGC2_SMS3_POS (8)
#define PWM_REGC2_SMS3_MASK (0xf)

#define PWM_REGC2_TS1_POS (12)
#define PWM_REGC2_TS1_MASK (0x7)

#define PWM_REGC2_RESERVED_15_15_POS (15)
#define PWM_REGC2_RESERVED_15_15_MASK (0x1)

#define PWM_REGC2_TS2_POS (16)
#define PWM_REGC2_TS2_MASK (0x7)

#define PWM_REGC2_TS3_POS (19)
#define PWM_REGC2_TS3_MASK (0x7)

#define PWM_REGC2_RESERVED_22_31_POS (22)
#define PWM_REGC2_RESERVED_22_31_MASK (0x3ff)

#define PWM_REGC3_ADDR (SOC_PWM_REG_BASE + (0xc3 << 2))

#define PWM_REGC3_CC1IE_POS (0)
#define PWM_REGC3_CC1IE_MASK (0x1)

#define PWM_REGC3_CC2IE_POS (1)
#define PWM_REGC3_CC2IE_MASK (0x1)

#define PWM_REGC3_CC3IE_POS (2)
#define PWM_REGC3_CC3IE_MASK (0x1)

#define PWM_REGC3_CC4IE_POS (3)
#define PWM_REGC3_CC4IE_MASK (0x1)

#define PWM_REGC3_CC5IE_POS (4)
#define PWM_REGC3_CC5IE_MASK (0x1)

#define PWM_REGC3_CC6IE_POS (5)
#define PWM_REGC3_CC6IE_MASK (0x1)

#define PWM_REGC3_CC7IE_POS (6)
#define PWM_REGC3_CC7IE_MASK (0x1)

#define PWM_REGC3_CC8IE_POS (7)
#define PWM_REGC3_CC8IE_MASK (0x1)

#define PWM_REGC3_CC9IE_POS (8)
#define PWM_REGC3_CC9IE_MASK (0x1)

#define PWM_REGC3_UIE1_POS (9)
#define PWM_REGC3_UIE1_MASK (0x1)

#define PWM_REGC3_UIE2_POS (10)
#define PWM_REGC3_UIE2_MASK (0x1)

#define PWM_REGC3_UIE3_POS (11)
#define PWM_REGC3_UIE3_MASK (0x1)

#define PWM_REGC3_TIE1_POS (12)
#define PWM_REGC3_TIE1_MASK (0x1)

#define PWM_REGC3_TIE2_POS (13)
#define PWM_REGC3_TIE2_MASK (0x1)

#define PWM_REGC3_TIE3_POS (14)
#define PWM_REGC3_TIE3_MASK (0x1)

#define PWM_REGC3_COMIE_POS (15)
#define PWM_REGC3_COMIE_MASK (0x1)

#define PWM_REGC3_RESERVED_16_19_POS (16)
#define PWM_REGC3_RESERVED_16_19_MASK (0xf)

#define PWM_REGC3_DF_TIM1_POS (20)
#define PWM_REGC3_DF_TIM1_MASK (0xf)

#define PWM_REGC3_DF_TIM2_POS (24)
#define PWM_REGC3_DF_TIM2_MASK (0xf)

#define PWM_REGC3_DF_TIM3_POS (28)
#define PWM_REGC3_DF_TIM3_MASK (0xf)

#define PWM_REGC4_ADDR (SOC_PWM_REG_BASE + (0xc4 << 2))

#define PWM_REGC4_CC1IF_POS (0)
#define PWM_REGC4_CC1IF_MASK (0x1)

#define PWM_REGC4_CC2IF_POS (1)
#define PWM_REGC4_CC2IF_MASK (0x1)

#define PWM_REGC4_CC3IF_POS (2)
#define PWM_REGC4_CC3IF_MASK (0x1)

#define PWM_REGC4_CC4IF_POS (3)
#define PWM_REGC4_CC4IF_MASK (0x1)

#define PWM_REGC4_CC5IF_POS (4)
#define PWM_REGC4_CC5IF_MASK (0x1)

#define PWM_REGC4_CC6IF_POS (5)
#define PWM_REGC4_CC6IF_MASK (0x1)

#define PWM_REGC4_CC7IF_POS (6)
#define PWM_REGC4_CC7IF_MASK (0x1)

#define PWM_REGC4_CC8IF_POS (7)
#define PWM_REGC4_CC8IF_MASK (0x1)

#define PWM_REGC4_CC9IF_POS (8)
#define PWM_REGC4_CC9IF_MASK (0x1)

#define PWM_REGC4_UIF1_POS (9)
#define PWM_REGC4_UIF1_MASK (0x1)

#define PWM_REGC4_UIF2_POS (10)
#define PWM_REGC4_UIF2_MASK (0x1)

#define PWM_REGC4_UIF3_POS (11)
#define PWM_REGC4_UIF3_MASK (0x1)

#define PWM_REGC4_TIF1_POS (12)
#define PWM_REGC4_TIF1_MASK (0x1)

#define PWM_REGC4_TIF2_POS (13)
#define PWM_REGC4_TIF2_MASK (0x1)

#define PWM_REGC4_TIF3_POS (14)
#define PWM_REGC4_TIF3_MASK (0x1)

#define PWM_REGC4_COMIF_POS (15)
#define PWM_REGC4_COMIF_MASK (0x1)

#define PWM_REGC4_RESERVED_16_31_POS (16)
#define PWM_REGC4_RESERVED_16_31_MASK (0xffff)

#define PWM_REGC5_ADDR (SOC_PWM_REG_BASE + (0xc5 << 2))

#define PWM_REGC5_RESERVED_0_8_POS (0)
#define PWM_REGC5_RESERVED_0_8_MASK (0x1ff)

#define PWM_REGC5_UG1_POS (9)
#define PWM_REGC5_UG1_MASK (0x1)

#define PWM_REGC5_UG2_POS (10)
#define PWM_REGC5_UG2_MASK (0x1)

#define PWM_REGC5_UG3_POS (11)
#define PWM_REGC5_UG3_MASK (0x1)

#define PWM_REGC5_TG1_POS (12)
#define PWM_REGC5_TG1_MASK (0x1)

#define PWM_REGC5_TG2_POS (13)
#define PWM_REGC5_TG2_MASK (0x1)

#define PWM_REGC5_TG3_POS (14)
#define PWM_REGC5_TG3_MASK (0x1)

#define PWM_REGC5_COMG_POS (15)
#define PWM_REGC5_COMG_MASK (0x1)

#define PWM_REGC5_DTM1_POS (16)
#define PWM_REGC5_DTM1_MASK (0x3)

#define PWM_REGC5_DTM2_POS (18)
#define PWM_REGC5_DTM2_MASK (0x3)

#define PWM_REGC5_DTM3_POS (20)
#define PWM_REGC5_DTM3_MASK (0x3)

#define PWM_REGC5_RESERVED_22_31_POS (22)
#define PWM_REGC5_RESERVED_22_31_MASK (0x3ff)

#define PWM_REGC6_ADDR (SOC_PWM_REG_BASE + (0xc6 << 2))

#define PWM_REGC6_CH1P_POS (0)
#define PWM_REGC6_CH1P_MASK (0x3)

#define PWM_REGC6_CH2P_POS (2)
#define PWM_REGC6_CH2P_MASK (0x3)

#define PWM_REGC6_CH3P_POS (4)
#define PWM_REGC6_CH3P_MASK (0x3)

#define PWM_REGC6_CH4P_POS (6)
#define PWM_REGC6_CH4P_MASK (0x3)

#define PWM_REGC6_CH5P_POS (8)
#define PWM_REGC6_CH5P_MASK (0x3)

#define PWM_REGC6_CH6P_POS (10)
#define PWM_REGC6_CH6P_MASK (0x3)

#define PWM_REGC6_CH1E_POS (12)
#define PWM_REGC6_CH1E_MASK (0x1)

