bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/pwm_reg.h
#define PWM_REGC6_CH2E_POS (13)
#define PWM_REGC6_CH2E_MASK (0x1)

#define PWM_REGC6_CH3E_POS (14)
#define PWM_REGC6_CH3E_MASK (0x1)

#define PWM_REGC6_CH4E_POS (15)
#define PWM_REGC6_CH4E_MASK (0x1)

#define PWM_REGC6_CH5E_POS (16)
#define PWM_REGC6_CH5E_MASK (0x1)

#define PWM_REGC6_CH6E_POS (17)
#define PWM_REGC6_CH6E_MASK (0x1)

#define PWM_REGC6_TIM1CCM_POS (18)
#define PWM_REGC6_TIM1CCM_MASK (0x1)

#define PWM_REGC6_TIM2CCM_POS (19)
#define PWM_REGC6_TIM2CCM_MASK (0x1)

#define PWM_REGC6_TIM3CCM_POS (20)
#define PWM_REGC6_TIM3CCM_MASK (0x1)

#define PWM_REGC6_OC1M_POS (21)
#define PWM_REGC6_OC1M_MASK (0x7)

#define PWM_REGC6_OC2M_POS (24)
#define PWM_REGC6_OC2M_MASK (0x7)

#define PWM_REGC6_OC3M_POS (27)
#define PWM_REGC6_OC3M_MASK (0x7)

#define PWM_REGC6_RESERVED_30_31_POS (30)
#define PWM_REGC6_RESERVED_30_31_MASK (0x3)

#define PWM_REGC7_ADDR (SOC_PWM_REG_BASE + (0xc7 << 2))

#define PWM_REGC7_TIM1_CNT_POS (0)
#define PWM_REGC7_TIM1_CNT_MASK (0xffffffff)

#define PWM_REGC8_ADDR (SOC_PWM_REG_BASE + (0xc8 << 2))

#define PWM_REGC8_TIM2_CNT_POS (0)
#define PWM_REGC8_TIM2_CNT_MASK (0xffffffff)

#define PWM_REGC9_ADDR (SOC_PWM_REG_BASE + (0xc9 << 2))

#define PWM_REGC9_TIM3_CNT_POS (0)
#define PWM_REGC9_TIM3_CNT_MASK (0xffffffff)

#define PWM_REGCA_ADDR (SOC_PWM_REG_BASE + (0xca << 2))

#define PWM_REGCA_PSC1_POS (0)
#define PWM_REGCA_PSC1_MASK (0xff)

#define PWM_REGCA_PSC2_POS (8)
#define PWM_REGCA_PSC2_MASK (0xff)

#define PWM_REGCA_PSC3_POS (16)
#define PWM_REGCA_PSC3_MASK (0xff)

#define PWM_REGCA_RESERVED_24_31_POS (24)
#define PWM_REGCA_RESERVED_24_31_MASK (0xff)

#define PWM_REGCB_ADDR (SOC_PWM_REG_BASE + (0xcb << 2))

#define PWM_REGCB_TIM1_ARR_POS (0)
#define PWM_REGCB_TIM1_ARR_MASK (0xffffffff)

#define PWM_REGCC_ADDR (SOC_PWM_REG_BASE + (0xcc << 2))

#define PWM_REGCC_TIM2_ARR_POS (0)
#define PWM_REGCC_TIM2_ARR_MASK (0xffffffff)

#define PWM_REGCD_ADDR (SOC_PWM_REG_BASE + (0xcd << 2))

#define PWM_REGCD_TIM3_ARR_POS (0)
#define PWM_REGCD_TIM3_ARR_MASK (0xffffffff)

#define PWM_REGCE_ADDR (SOC_PWM_REG_BASE + (0xce << 2))

#define PWM_REGCE_TIM1_RCR_POS (0)
#define PWM_REGCE_TIM1_RCR_MASK (0xffffffff)

#define PWM_REGCF_ADDR (SOC_PWM_REG_BASE + (0xcf << 2))

#define PWM_REGCF_TIM2_RCR_POS (0)
#define PWM_REGCF_TIM2_RCR_MASK (0xffffffff)

#define PWM_REGD0_ADDR (SOC_PWM_REG_BASE + (0xd0 << 2))

#define PWM_REGD0_TIM3_RCR_POS (0)
#define PWM_REGD0_TIM3_RCR_MASK (0xffffffff)

#define PWM_REGD1_ADDR (SOC_PWM_REG_BASE + (0xd1 << 2))

#define PWM_REGD1_CCR1_POS (0)
#define PWM_REGD1_CCR1_MASK (0xffffffff)

#define PWM_REGD2_ADDR (SOC_PWM_REG_BASE + (0xd2 << 2))

#define PWM_REGD2_CCR2_POS (0)
#define PWM_REGD2_CCR2_MASK (0xffffffff)

#define PWM_REGD3_ADDR (SOC_PWM_REG_BASE + (0xd3 << 2))

#define PWM_REGD3_CCR3_POS (0)
#define PWM_REGD3_CCR3_MASK (0xffffffff)

#define PWM_REGD4_ADDR (SOC_PWM_REG_BASE + (0xd4 << 2))

#define PWM_REGD4_CCR4_POS (0)
#define PWM_REGD4_CCR4_MASK (0xffffffff)

#define PWM_REGD5_ADDR (SOC_PWM_REG_BASE + (0xd5 << 2))

#define PWM_REGD5_CCR5_POS (0)
#define PWM_REGD5_CCR5_MASK (0xffffffff)

#define PWM_REGD6_ADDR (SOC_PWM_REG_BASE + (0xd6 << 2))

#define PWM_REGD6_CCR6_POS (0)
#define PWM_REGD6_CCR6_MASK (0xffffffff)

#define PWM_REGD7_ADDR (SOC_PWM_REG_BASE + (0xd7 << 2))

#define PWM_REGD7_CCR7_POS (0)
#define PWM_REGD7_CCR7_MASK (0xffffffff)

#define PWM_REGD8_ADDR (SOC_PWM_REG_BASE + (0xd8 << 2))

#define PWM_REGD8_CCR8_POS (0)
#define PWM_REGD8_CCR8_MASK (0xffffffff)

#define PWM_REGD9_ADDR (SOC_PWM_REG_BASE + (0xd9 << 2))

#define PWM_REGD9_CCR9_POS (0)
#define PWM_REGD9_CCR9_MASK (0xffffffff)

#define PWM_REGDA_ADDR (SOC_PWM_REG_BASE + (0xda << 2))

#define PWM_REGDA_DT1_POS (0)
#define PWM_REGDA_DT1_MASK (0x3ff)

#define PWM_REGDA_DT2_POS (10)
#define PWM_REGDA_DT2_MASK (0x3ff)

#define PWM_REGDA_DT3_POS (20)
#define PWM_REGDA_DT3_MASK (0x3ff)

#define PWM_REGDA_RESERVED_30_31_POS (30)
#define PWM_REGDA_RESERVED_30_31_MASK (0x3)

#define PWM_REGDB_ADDR (SOC_PWM_REG_BASE + (0xdb << 2))

#define PWM_REGDB_TIM1_ARR_SHAD_POS (0)
#define PWM_REGDB_TIM1_ARR_SHAD_MASK (0xffffffff)

#define PWM_REGDC_ADDR (SOC_PWM_REG_BASE + (0xdc << 2))

#define PWM_REGDC_TIM2_ARR_SHAD_POS (0)
#define PWM_REGDC_TIM2_ARR_SHAD_MASK (0xffffffff)

#define PWM_REGDD_ADDR (SOC_PWM_REG_BASE + (0xdd << 2))

#define PWM_REGDD_TIM3_ARR_SHAD_POS (0)
#define PWM_REGDD_TIM3_ARR_SHAD_MASK (0xffffffff)

#define PWM_REGDE_ADDR (SOC_PWM_REG_BASE + (0xde << 2))

#define PWM_REGDE_TIM1_RCR_SHAD_POS (0)
#define PWM_REGDE_TIM1_RCR_SHAD_MASK (0xffffffff)

#define PWM_REGDF_ADDR (SOC_PWM_REG_BASE + (0xdf << 2))

#define PWM_REGDF_TIM2_RCR_SHAD_POS (0)
#define PWM_REGDF_TIM2_RCR_SHAD_MASK (0xffffffff)

#define PWM_REGE0_ADDR (SOC_PWM_REG_BASE + (0xe0 << 2))

#define PWM_REGE0_TIM3_RCR_SHAD_POS (0)
#define PWM_REGE0_TIM3_RCR_SHAD_MASK (0xffffffff)

#define PWM_REGE1_ADDR (SOC_PWM_REG_BASE + (0xe1 << 2))

#define PWM_REGE1_CCR1_SHAD_POS (0)
#define PWM_REGE1_CCR1_SHAD_MASK (0xffffffff)

#define PWM_REGE2_ADDR (SOC_PWM_REG_BASE + (0xe2 << 2))

#define PWM_REGE2_CCR2_SHAD_POS (0)
#define PWM_REGE2_CCR2_SHAD_MASK (0xffffffff)

#define PWM_REGE3_ADDR (SOC_PWM_REG_BASE + (0xe3 << 2))

#define PWM_REGE3_CCR3_SHAD_POS (0)
#define PWM_REGE3_CCR3_SHAD_MASK (0xffffffff)

#define PWM_REGE4_ADDR (SOC_PWM_REG_BASE + (0xe4 << 2))

#define PWM_REGE4_CCR4_SHAD_POS (0)
#define PWM_REGE4_CCR4_SHAD_MASK (0xffffffff)

#define PWM_REGE5_ADDR (SOC_PWM_REG_BASE + (0xe5 << 2))

#define PWM_REGE5_CCR5_SHAD_POS (0)
#define PWM_REGE5_CCR5_SHAD_MASK (0xffffffff)

#define PWM_REGE6_ADDR (SOC_PWM_REG_BASE + (0xe6 << 2))

#define PWM_REGE6_CCR6_SHAD_POS (0)
#define PWM_REGE6_CCR6_SHAD_MASK (0xffffffff)

#define PWM_REGE7_ADDR (SOC_PWM_REG_BASE + (0xe7 << 2))

#define PWM_REGE7_CCR7_SHAD_POS (0)
#define PWM_REGE7_CCR7_SHAD_MASK (0xffffffff)

#define PWM_REGE8_ADDR (SOC_PWM_REG_BASE + (0xe8 << 2))

#define PWM_REGE8_CCR8_SHAD_POS (0)
#define PWM_REGE8_CCR8_SHAD_MASK (0xffffffff)

#define PWM_REGE9_ADDR (SOC_PWM_REG_BASE + (0xe9 << 2))

