bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/pwm_reg.h
#define PWM_REG104_CC8IF_POS (7)
#define PWM_REG104_CC8IF_MASK (0x1)

#define PWM_REG104_CC9IF_POS (8)
#define PWM_REG104_CC9IF_MASK (0x1)

#define PWM_REG104_UIF1_POS (9)
#define PWM_REG104_UIF1_MASK (0x1)

#define PWM_REG104_UIF2_POS (10)
#define PWM_REG104_UIF2_MASK (0x1)

#define PWM_REG104_UIF3_POS (11)
#define PWM_REG104_UIF3_MASK (0x1)

#define PWM_REG104_TIF1_POS (12)
#define PWM_REG104_TIF1_MASK (0x1)

#define PWM_REG104_TIF2_POS (13)
#define PWM_REG104_TIF2_MASK (0x1)

#define PWM_REG104_TIF3_POS (14)
#define PWM_REG104_TIF3_MASK (0x1)

#define PWM_REG104_COMIF_POS (15)
#define PWM_REG104_COMIF_MASK (0x1)

#define PWM_REG104_RESERVED_16_31_POS (16)
#define PWM_REG104_RESERVED_16_31_MASK (0xffff)

#define PWM_REG105_ADDR (SOC_PWM_REG_BASE + (0x105 << 2))

#define PWM_REG105_RESERVED_0_8_POS (0)
#define PWM_REG105_RESERVED_0_8_MASK (0x1ff)

#define PWM_REG105_UG1_POS (9)
#define PWM_REG105_UG1_MASK (0x1)

#define PWM_REG105_UG2_POS (10)
#define PWM_REG105_UG2_MASK (0x1)

#define PWM_REG105_UG3_POS (11)
#define PWM_REG105_UG3_MASK (0x1)

#define PWM_REG105_TG1_POS (12)
#define PWM_REG105_TG1_MASK (0x1)

#define PWM_REG105_TG2_POS (13)
#define PWM_REG105_TG2_MASK (0x1)

#define PWM_REG105_TG3_POS (14)
#define PWM_REG105_TG3_MASK (0x1)

#define PWM_REG105_COMG_POS (15)
#define PWM_REG105_COMG_MASK (0x1)

#define PWM_REG105_DTM1_POS (16)
#define PWM_REG105_DTM1_MASK (0x3)

#define PWM_REG105_DTM2_POS (18)
#define PWM_REG105_DTM2_MASK (0x3)

#define PWM_REG105_DTM3_POS (20)
#define PWM_REG105_DTM3_MASK (0x3)

#define PWM_REG105_RESERVED_22_31_POS (22)
#define PWM_REG105_RESERVED_22_31_MASK (0x3ff)

#define PWM_REG106_ADDR (SOC_PWM_REG_BASE + (0x106 << 2))

#define PWM_REG106_CH1P_POS (0)
#define PWM_REG106_CH1P_MASK (0x3)

#define PWM_REG106_CH2P_POS (2)
#define PWM_REG106_CH2P_MASK (0x3)

#define PWM_REG106_CH3P_POS (4)
#define PWM_REG106_CH3P_MASK (0x3)

#define PWM_REG106_CH4P_POS (6)
#define PWM_REG106_CH4P_MASK (0x3)

#define PWM_REG106_CH5P_POS (8)
#define PWM_REG106_CH5P_MASK (0x3)

#define PWM_REG106_CH6P_POS (10)
#define PWM_REG106_CH6P_MASK (0x3)

#define PWM_REG106_CH1E_POS (12)
#define PWM_REG106_CH1E_MASK (0x1)

#define PWM_REG106_CH2E_POS (13)
#define PWM_REG106_CH2E_MASK (0x1)

#define PWM_REG106_CH3E_POS (14)
#define PWM_REG106_CH3E_MASK (0x1)

#define PWM_REG106_CH4E_POS (15)
#define PWM_REG106_CH4E_MASK (0x1)

#define PWM_REG106_CH5E_POS (16)
#define PWM_REG106_CH5E_MASK (0x1)

#define PWM_REG106_CH6E_POS (17)
#define PWM_REG106_CH6E_MASK (0x1)

#define PWM_REG106_TIM1CCM_POS (18)
#define PWM_REG106_TIM1CCM_MASK (0x1)

#define PWM_REG106_TIM2CCM_POS (19)
#define PWM_REG106_TIM2CCM_MASK (0x1)

#define PWM_REG106_TIM3CCM_POS (20)
#define PWM_REG106_TIM3CCM_MASK (0x1)

#define PWM_REG106_OC1M_POS (21)
#define PWM_REG106_OC1M_MASK (0x7)

#define PWM_REG106_OC2M_POS (24)
#define PWM_REG106_OC2M_MASK (0x7)

#define PWM_REG106_OC3M_POS (27)
#define PWM_REG106_OC3M_MASK (0x7)

#define PWM_REG106_RESERVED_30_31_POS (30)
#define PWM_REG106_RESERVED_30_31_MASK (0x3)

#define PWM_REG107_ADDR (SOC_PWM_REG_BASE + (0x107 << 2))

#define PWM_REG107_TIM1_CNT_POS (0)
#define PWM_REG107_TIM1_CNT_MASK (0xffffffff)

#define PWM_REG108_ADDR (SOC_PWM_REG_BASE + (0x108 << 2))

#define PWM_REG108_TIM2_CNT_POS (0)
#define PWM_REG108_TIM2_CNT_MASK (0xffffffff)

#define PWM_REG109_ADDR (SOC_PWM_REG_BASE + (0x109 << 2))

#define PWM_REG109_TIM3_CNT_POS (0)
#define PWM_REG109_TIM3_CNT_MASK (0xffffffff)

#define PWM_REG10A_ADDR (SOC_PWM_REG_BASE + (0x10a << 2))

#define PWM_REG10A_PSC1_POS (0)
#define PWM_REG10A_PSC1_MASK (0xff)

#define PWM_REG10A_PSC2_POS (8)
#define PWM_REG10A_PSC2_MASK (0xff)

#define PWM_REG10A_PSC3_POS (16)
#define PWM_REG10A_PSC3_MASK (0xff)

#define PWM_REG10A_RESERVED_24_31_POS (24)
#define PWM_REG10A_RESERVED_24_31_MASK (0xff)

#define PWM_REG10B_ADDR (SOC_PWM_REG_BASE + (0x10b << 2))

#define PWM_REG10B_TIM1_ARR_POS (0)
#define PWM_REG10B_TIM1_ARR_MASK (0xffffffff)

#define PWM_REG10C_ADDR (SOC_PWM_REG_BASE + (0x10c << 2))

#define PWM_REG10C_TIM2_ARR_POS (0)
#define PWM_REG10C_TIM2_ARR_MASK (0xffffffff)

#define PWM_REG10D_ADDR (SOC_PWM_REG_BASE + (0x10d << 2))

#define PWM_REG10D_TIM3_ARR_POS (0)
#define PWM_REG10D_TIM3_ARR_MASK (0xffffffff)

#define PWM_REG10E_ADDR (SOC_PWM_REG_BASE + (0x10e << 2))

#define PWM_REG10E_TIM1_RCR_POS (0)
#define PWM_REG10E_TIM1_RCR_MASK (0xffffffff)

#define PWM_REG10F_ADDR (SOC_PWM_REG_BASE + (0x10f << 2))

#define PWM_REG10F_TIM2_RCR_POS (0)
#define PWM_REG10F_TIM2_RCR_MASK (0xffffffff)

#define PWM_REG110_ADDR (SOC_PWM_REG_BASE + (0x110 << 2))

#define PWM_REG110_TIM3_RCR_POS (0)
#define PWM_REG110_TIM3_RCR_MASK (0xffffffff)

#define PWM_REG111_ADDR (SOC_PWM_REG_BASE + (0x111 << 2))

#define PWM_REG111_CCR1_POS (0)
#define PWM_REG111_CCR1_MASK (0xffffffff)

#define PWM_REG112_ADDR (SOC_PWM_REG_BASE + (0x112 << 2))

#define PWM_REG112_CCR2_POS (0)
#define PWM_REG112_CCR2_MASK (0xffffffff)

#define PWM_REG113_ADDR (SOC_PWM_REG_BASE + (0x113 << 2))

#define PWM_REG113_CCR3_POS (0)
#define PWM_REG113_CCR3_MASK (0xffffffff)

#define PWM_REG114_ADDR (SOC_PWM_REG_BASE + (0x114 << 2))

#define PWM_REG114_CCR4_POS (0)
#define PWM_REG114_CCR4_MASK (0xffffffff)

#define PWM_REG115_ADDR (SOC_PWM_REG_BASE + (0x115 << 2))

#define PWM_REG115_CCR5_POS (0)
#define PWM_REG115_CCR5_MASK (0xffffffff)

#define PWM_REG116_ADDR (SOC_PWM_REG_BASE + (0x116 << 2))

#define PWM_REG116_CCR6_POS (0)
#define PWM_REG116_CCR6_MASK (0xffffffff)

#define PWM_REG117_ADDR (SOC_PWM_REG_BASE + (0x117 << 2))

#define PWM_REG117_CCR7_POS (0)
#define PWM_REG117_CCR7_MASK (0xffffffff)

#define PWM_REG118_ADDR (SOC_PWM_REG_BASE + (0x118 << 2))

#define PWM_REG118_CCR8_POS (0)
#define PWM_REG118_CCR8_MASK (0xffffffff)

#define PWM_REG119_ADDR (SOC_PWM_REG_BASE + (0x119 << 2))

#define PWM_REG119_CCR9_POS (0)
#define PWM_REG119_CCR9_MASK (0xffffffff)

#define PWM_REG11A_ADDR (SOC_PWM_REG_BASE + (0x11a << 2))

#define PWM_REG11A_DT1_POS (0)
#define PWM_REG11A_DT1_MASK (0x3ff)

#define PWM_REG11A_DT2_POS (10)
#define PWM_REG11A_DT2_MASK (0x3ff)

#define PWM_REG11A_DT3_POS (20)
#define PWM_REG11A_DT3_MASK (0x3ff)

#define PWM_REG11A_RESERVED_30_31_POS (30)
#define PWM_REG11A_RESERVED_30_31_MASK (0x3)

#define PWM_REG11B_ADDR (SOC_PWM_REG_BASE + (0x11b << 2))

