bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/pwm_reg.h
#define PWM_REG11B_TIM1_ARR_SHAD_POS (0)
#define PWM_REG11B_TIM1_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG11C_ADDR (SOC_PWM_REG_BASE + (0x11c << 2))

#define PWM_REG11C_TIM2_ARR_SHAD_POS (0)
#define PWM_REG11C_TIM2_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG11D_ADDR (SOC_PWM_REG_BASE + (0x11d << 2))

#define PWM_REG11D_TIM3_ARR_SHAD_POS (0)
#define PWM_REG11D_TIM3_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG11E_ADDR (SOC_PWM_REG_BASE + (0x11e << 2))

#define PWM_REG11E_TIM1_RCR_SHAD_POS (0)
#define PWM_REG11E_TIM1_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG11F_ADDR (SOC_PWM_REG_BASE + (0x11f << 2))

#define PWM_REG11F_TIM2_RCR_SHAD_POS (0)
#define PWM_REG11F_TIM2_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG120_ADDR (SOC_PWM_REG_BASE + (0x120 << 2))

#define PWM_REG120_TIM3_RCR_SHAD_POS (0)
#define PWM_REG120_TIM3_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG121_ADDR (SOC_PWM_REG_BASE + (0x121 << 2))

#define PWM_REG121_CCR1_SHAD_POS (0)
#define PWM_REG121_CCR1_SHAD_MASK (0xffffffff)

#define PWM_REG122_ADDR (SOC_PWM_REG_BASE + (0x122 << 2))

#define PWM_REG122_CCR2_SHAD_POS (0)
#define PWM_REG122_CCR2_SHAD_MASK (0xffffffff)

#define PWM_REG123_ADDR (SOC_PWM_REG_BASE + (0x123 << 2))

#define PWM_REG123_CCR3_SHAD_POS (0)
#define PWM_REG123_CCR3_SHAD_MASK (0xffffffff)

#define PWM_REG124_ADDR (SOC_PWM_REG_BASE + (0x124 << 2))

#define PWM_REG124_CCR4_SHAD_POS (0)
#define PWM_REG124_CCR4_SHAD_MASK (0xffffffff)

#define PWM_REG125_ADDR (SOC_PWM_REG_BASE + (0x125 << 2))

#define PWM_REG125_CCR5_SHAD_POS (0)
#define PWM_REG125_CCR5_SHAD_MASK (0xffffffff)

#define PWM_REG126_ADDR (SOC_PWM_REG_BASE + (0x126 << 2))

#define PWM_REG126_CCR6_SHAD_POS (0)
#define PWM_REG126_CCR6_SHAD_MASK (0xffffffff)

#define PWM_REG127_ADDR (SOC_PWM_REG_BASE + (0x127 << 2))

#define PWM_REG127_CCR7_SHAD_POS (0)
#define PWM_REG127_CCR7_SHAD_MASK (0xffffffff)

#define PWM_REG128_ADDR (SOC_PWM_REG_BASE + (0x128 << 2))

#define PWM_REG128_CCR8_SHAD_POS (0)
#define PWM_REG128_CCR8_SHAD_MASK (0xffffffff)

#define PWM_REG129_ADDR (SOC_PWM_REG_BASE + (0x129 << 2))

#define PWM_REG129_CCR9_SHAD_POS (0)
#define PWM_REG129_CCR9_SHAD_MASK (0xffffffff)

#define PWM_REG12A_ADDR (SOC_PWM_REG_BASE + (0x12a << 2))

#define PWM_REG12A_CH6E_SHAD_POS (0)
#define PWM_REG12A_CH6E_SHAD_MASK (0x1)

#define PWM_REG12A_CH5E_SHAD_POS (1)
#define PWM_REG12A_CH5E_SHAD_MASK (0x1)

#define PWM_REG12A_CH4E_SHAD_POS (2)
#define PWM_REG12A_CH4E_SHAD_MASK (0x1)

#define PWM_REG12A_CH3E_SHAD_POS (3)
#define PWM_REG12A_CH3E_SHAD_MASK (0x1)

#define PWM_REG12A_CH2E_SHAD_POS (4)
#define PWM_REG12A_CH2E_SHAD_MASK (0x1)

#define PWM_REG12A_CH1E_SHAD_POS (5)
#define PWM_REG12A_CH1E_SHAD_MASK (0x1)

#define PWM_REG12A_OC1M_SHAD_POS (6)
#define PWM_REG12A_OC1M_SHAD_MASK (0x7)

#define PWM_REG12A_OC2M_SHAD_POS (9)
#define PWM_REG12A_OC2M_SHAD_MASK (0x7)

#define PWM_REG12A_OC3M_SHAD_POS (12)
#define PWM_REG12A_OC3M_SHAD_MASK (0x7)

#define PWM_REG12A_RESERVED_15_31_POS (15)
#define PWM_REG12A_RESERVED_15_31_MASK (0x1ffff)

#ifdef __cplusplus
}
#endif
